jonahn/EE478/Lab2/PIC_SOURCES/h/p18f66j99.h
extern volatile far  unsigned char       RPINR0_1;
extern volatile far  union {
  struct {
    unsigned U1RXR:4;
    unsigned U1TXR:4;
  };
  struct {
    unsigned U1RXR0:1;
    unsigned U1RXR1:1;
    unsigned U1RXR2:1;
    unsigned U1RXR3:1;
    unsigned U1TXR0:1;
    unsigned U1TXR1:1;
    unsigned U1TXR2:1;
    unsigned U1TXR3:1;
  };
} RPINR0_1bits;
extern volatile far  unsigned char       RPINR2_3;
extern volatile far  union {
  struct {
    unsigned U2RXR:4;
    unsigned U2TXR:4;
  };
  struct {
    unsigned U2RXR0:1;
    unsigned U2RXR1:1;
    unsigned U2RXR2:1;
    unsigned U2RXR3:1;
    unsigned U2TXR0:1;
    unsigned U2TXR1:1;
    unsigned U2TXR2:1;
    unsigned U2TXR3:1;
  };
} RPINR2_3bits;
extern volatile far  unsigned char       RPINR4_5;
extern volatile far  union {
  struct {
    unsigned U3RXR:4;
    unsigned U3TXR:4;
  };
  struct {
    unsigned U3RXR0:1;
    unsigned U3RXR1:1;
    unsigned U3RXR2:1;
    unsigned U3RXR3:1;
    unsigned U3TXR0:1;
    unsigned U3TXR1:1;
    unsigned U3TXR2:1;
    unsigned U3TXR3:1;
  };
} RPINR4_5bits;
extern volatile far  unsigned char       RPINR6_7;
extern volatile far  union {
  struct {
    unsigned U4RXR:4;
    unsigned U4TXR:4;
  };
  struct {
    unsigned U4RXR0:1;
    unsigned U4RXR1:1;
    unsigned U4RXR2:1;
    unsigned U4RXR3:1;
    unsigned U4TXR0:1;
    unsigned U4TXR1:1;
    unsigned U4TXR2:1;
    unsigned U4TXR3:1;
  };
} RPINR6_7bits;
extern volatile far  unsigned char       RPINR8_9;
extern volatile far  union {
  struct {
    unsigned SCK1R:4;
    unsigned SDI1R:4;
  };
  struct {
    unsigned SCK1R0:1;
    unsigned SCK1R1:1;
    unsigned SCK1R2:1;
    unsigned SCK1R3:1;
    unsigned SDI1R0:1;
    unsigned SDI1R1:1;
    unsigned SDI1R2:1;
    unsigned SDI1R3:1;
  };
} RPINR8_9bits;
extern volatile far  unsigned char       RPINR10_11;
extern volatile far  union {
  struct {
    unsigned SS1R:4;
    unsigned SCK2R:4;
  };
  struct {
    unsigned SS1R0:1;
    unsigned SS1R1:1;
    unsigned SS1R2:1;
    unsigned SS1R3:1;
    unsigned SCK2R0:1;
    unsigned SCK2R1:1;
    unsigned SCK2R2:1;
    unsigned SCK2R3:1;
  };
} RPINR10_11bits;
extern volatile far  unsigned char       RPINR12_13;
extern volatile far  union {
  struct {
    unsigned SDI2R:4;
    unsigned SS2R:4;
  };
  struct {
    unsigned SDI2R0:1;
    unsigned SDI2R1:1;
    unsigned SDI2R2:1;
    unsigned SDI2R3:1;
    unsigned SS2R0:1;
    unsigned SS2R1:1;
    unsigned SS2R2:1;
    unsigned SS2R3:1;
  };
} RPINR12_13bits;
extern volatile far  unsigned char       RPINR14_15;
extern volatile far  union {
  struct {
    unsigned FLT0R:4;
    unsigned ECCP1R:4;
  };
  struct {
    unsigned FLT0R0:1;
    unsigned FLT0R1:1;
    unsigned FLT0R2:1;
    unsigned FLT0R3:1;
    unsigned ECCP1R0:1;
    unsigned ECCP1R1:1;
    unsigned ECCP1R2:1;
    unsigned ECCP1R3:1;
  };
} RPINR14_15bits;
extern volatile far  unsigned char       RPINR16_17;
extern volatile far  union {
  struct {
    unsigned ECCP2R:4;
    unsigned ECCP3R:4;
  };
  struct {
    unsigned ECCP2R0:1;
    unsigned ECCP2R1:1;
    unsigned ECCP2R2:1;
    unsigned ECCP2R3:1;
    unsigned ECCP3R0:1;
    unsigned ECCP3R1:1;
    unsigned ECCP3R2:1;
    unsigned ECCP3R3:1;
  };
} RPINR16_17bits;
extern volatile far  unsigned char       RPINR18_19;
extern volatile far  union {
  struct {
    unsigned IOC0R:4;
    unsigned IOC1R:4;
  };
  struct {
    unsigned IOC0R0:1;
    unsigned IOC0R1:1;
    unsigned IOC0R2:1;
    unsigned IOC0R3:1;
    unsigned IOC1R0:1;
    unsigned IOC1R1:1;
    unsigned IOC1R2:1;
    unsigned IOC1R3:1;
  };
} RPINR18_19bits;
extern volatile far  unsigned char       RPINR20_21;
extern volatile far  union {
  struct {
    unsigned IOC2R:4;
    unsigned IOC3R:4;
  };
  struct {
    unsigned IOC2R0:1;
    unsigned IOC2R1:1;
    unsigned IOC2R2:1;
    unsigned IOC2R3:1;
    unsigned IOC3R0:1;
    unsigned IOC3R1:1;
    unsigned IOC3R2:1;
    unsigned IOC3R3:1;
  };
} RPINR20_21bits;
extern volatile far  unsigned char       RPINR22_23;
extern volatile far  union {
  struct {
    unsigned IOC4R:4;
    unsigned IOC5R:4;
  };
  struct {
    unsigned IOC4R0:1;
    unsigned IOC4R1:1;
    unsigned IOC4R2:1;
    unsigned IOC4R3:1;
    unsigned IOC5R0:1;
    unsigned IOC5R1:1;
    unsigned IOC5R2:1;
    unsigned IOC5R3:1;
  };
} RPINR22_23bits;
extern volatile far  unsigned char       RPINR24_25;
extern volatile far  union {
  struct {
    unsigned IOC6R:4;
    unsigned IOC7R:4;
  };
  struct {
    unsigned IOC6R0:1;
    unsigned IOC6R1:1;
    unsigned IOC6R2:1;
    unsigned IOC6R3:1;
    unsigned IOC7R0:1;
    unsigned IOC7R1:1;
    unsigned IOC7R2:1;
    unsigned IOC7R3:1;
  };
} RPINR24_25bits;
extern volatile far  unsigned char       RPINR26_27;
extern volatile far  union {
  struct {
    unsigned INT1R:4;
    unsigned INT2R:4;
  };
  struct {
    unsigned INT1R0:1;
    unsigned INT1R1:1;
    unsigned INT1R2:1;
    unsigned INT1R3:1;
    unsigned INT2R0:1;
    unsigned INT2R1:1;
    unsigned INT2R2:1;
    unsigned INT2R3:1;
  };
} RPINR26_27bits;
extern volatile far  unsigned char       RPINR28_29;
extern volatile far  union {
  struct {
    unsigned INT3R:4;
    unsigned MDMINR:4;
  };
  struct {
    unsigned INT3R0:1;
    unsigned INT3R1:1;
    unsigned INT3R2:1;
    unsigned INT3R3:1;
    unsigned MDMINR0:1;
    unsigned MDMINR1:1;
    unsigned MDMINR2:1;
    unsigned MDMINR3:1;
  };
} RPINR28_29bits;
extern volatile far  unsigned char       RPINR30_31;
extern volatile far  union {
  struct {
    unsigned MDCIN1R:4;
    unsigned MDCIN2R:4;
  };
  struct {
    unsigned MDCIN1R0:1;
    unsigned MDCIN1R1:1;
    unsigned MDCIN1R2:1;
    unsigned MDCIN1R3:1;
    unsigned MDCIN2R0:1;
    unsigned MDCIN2R1:1;
    unsigned MDCIN2R2:1;
    unsigned MDCIN2R3:1;
  };
} RPINR30_31bits;
extern volatile far  unsigned char       RPINR32_33;
extern volatile far  union {
  struct {
    unsigned CCP4R:4;
    unsigned CCP5R:4;
  };
  struct {
    unsigned CCP4R0:1;
    unsigned CCP4R1:1;
    unsigned CCP4R2:1;
    unsigned CCP4R3:1;
    unsigned CCP5R0:1;
    unsigned CCP5R1:1;
    unsigned CCP5R2:1;
    unsigned CCP5R3:1;
  };
} RPINR32_33bits;
extern volatile far  unsigned char       RPINR34_35;
extern volatile far  union {
  struct {
    unsigned CCP6R:4;
    unsigned CCP7R:4;
  };
  struct {
    unsigned CCP6R0:1;
    unsigned CCP6R1:1;
    unsigned CCP6R2:1;
    unsigned CCP6R3:1;
    unsigned CCP7R0:1;
    unsigned CCP7R1:1;
    unsigned CCP7R2:1;
    unsigned CCP7R3:1;
  };
} RPINR34_35bits;
extern volatile far  unsigned char       RPINR36_37;
extern volatile far  union {
  struct {
    unsigned CCP8R:4;
    unsigned CCP9R:4;
  };
  struct {
    unsigned CCP8R0:1;
    unsigned CCP8R1:1;
    unsigned CCP8R2:1;
    unsigned CCP8R3:1;
    unsigned CCP9R0:1;
    unsigned CCP9R1:1;
    unsigned CCP9R2:1;
    unsigned CCP9R3:1;
  };
} RPINR36_37bits;
